# Ex - GroupBy

### Introduction:

GroupBy can be summarizes as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

In [1]:
import numpy as np

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

In [3]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv"

### Step 3. Assign it to a variable called drinks.

In [4]:
drinks=pd.read_csv(url, sep=',')

In [5]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. Which continent drinks more beer on average?

In [24]:
drinks.groupby('continent')['beer_servings'].sum().sort_values(ascending=False).head(1)

continent
EU    8720
Name: beer_servings, dtype: int64

### Step 5. For each continent print the statistics for wine consumption.

In [25]:
drinks.groupby('continent')['wine_servings'].sum().sort_values(ascending=False)

continent
EU    6400
AF     862
SA     749
OC     570
AS     399
Name: wine_servings, dtype: int64

### Step 6. Print the mean alcoohol consumption per continent for every column

In [26]:
drinks.groupby('continent')['total_litres_of_pure_alcohol'].mean().sort_values(ascending=False)

continent
EU    8.617778
SA    6.308333
OC    3.381250
AF    3.007547
AS    2.170455
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 7. Print the median alcoohol consumption per continent for every column

In [27]:
drinks.groupby('continent')['total_litres_of_pure_alcohol'].median().sort_values(ascending=False)

continent
EU    10.00
SA     6.85
AF     2.30
OC     1.75
AS     1.20
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [31]:
dataframe = drinks.groupby('continent')['total_litres_of_pure_alcohol'].describe()[['min','max','mean']]

In [32]:
dataframe.describe()

            min        max      mean
count  5.000000   5.000000  5.000000
mean   0.760000  10.740000  4.697073
std    1.699412   2.383904  2.689692
min    0.000000   8.300000  2.170455
25%    0.000000   9.100000  3.007547
50%    0.000000  10.400000  3.381250
75%    0.000000  11.500000  6.308333
max    3.800000  14.400000  8.617778

In [33]:
dataframe

           min   max      mean
continent
AF         0.0   9.1  3.007547
AS         0.0  11.5  2.170455
EU         0.0  14.4  8.617778
OC         0.0  10.4  3.381250
SA         3.8   8.3  6.308333